EXERCISE_DESCRIPTION_LENGTH: int = 200
"""Ограничение длины полей "Описание"."""

EXERCISE_TITLE_LENGTH: int = 50
"""Ограничение длины поля "Название" модели заданий."""

QUESTION_LIMIT: int = 1000
"""Ограничение длины вопроса в модели заданий."""

ANSWER_LIMIT: int = 1000
"""Ограничение длины текстового поля ответа."""

ANSWERS_GROUP_LIMIT: int = 50
"""Ограничение длины названия группы в соответсвующем типе ответа."""

FREE_SUCCESS_THRESHOLD = 0.6
"""
Минимальное количество правильного в свободном ответе
(на стороне фронтенда умножается на 100).
"""
